src/cf/Documents/уатСчетФактураВыданный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатСчетФактураВыданный</Name>
			<BasedOn>
				<xr:Item>Document.уатРеализацияУслуг</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчетаФактуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидСчетаФактурыВыставленного</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выставлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыставления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>Договор контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзТиповойКонфигурации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСпособаВыставления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсправления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснованиеТиповаяКонфигурация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчитыватьИсправлениеИсходногоДокумента</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходныйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатСчетФактураВыданный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПлатежноРасчетныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСчетаФактурыНаАванс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСчетаФактурыНаАванс</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/ВидСчетаФактурыВыставленного.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидСчетаФактурыВыставленного</Name>
			<Comment>Вид выставленного счета-фактуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КорректировочнаяСправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировочный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаАванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаАвансКомитента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаАвансКомитентаНаЗакупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРеализацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСуммовуюРазницу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводнаяСправка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ПодразделенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПодразделенияОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеРегламентированногоУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Documents/уатСчетФактураВыданный/Forms/ФормаДокументыОснования/Ext/Form/Module.bsl
&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("Отбор") Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	Организация                      = Параметры.Отбор.Организация;
	Контрагент                       = Параметры.Отбор.Контрагент;
	ДоговорКонтрагента               = Параметры.Отбор.Договор;
	СчетФактура                      = Параметры.ЗначенияЗаполнения.СчетФактура;
	Исправление                      = Параметры.ЗначенияЗаполнения.Исправление;
	ВидСчетаФактуры                  = Параметры.ЗначенияЗаполнения.ВидСчетаФактуры;

	Если Параметры.ЗначенияЗаполнения.Свойство("ИсправляемыйСчетФактура") Тогда 
		ИсправляемыйСчетФактура = Параметры.ЗначенияЗаполнения.ИсправляемыйСчетФактура;
	КонецЕсли;
	
	Если Параметры.ЗначенияЗаполнения.Свойство("ДатаСчетаФактуры") Тогда 
		ДатаСчетаФактуры = Параметры.ЗначенияЗаполнения.ДатаСчетаФактуры;
	КонецЕсли;
	
	ЭтоСводнаяСправка = ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.СводнаяСправка;
	ЭтоКорректировочнаяСправка = ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.КорректировочнаяСправка;
	ЭтоКорректировочный = ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.Корректировочный;
	
	Если Параметры.ЗначенияЗаполнения.Свойство("СписокДокументовОснований") Тогда 
		
		ТаблицаТекущихОснований = Параметры.ЗначенияЗаполнения.СписокДокументовОснований;
		ПодразделениеОснований = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
		
		Если ТаблицаТекущихОснований.Количество() > 0
			И ТипЗнч(ТаблицаТекущихОснований[0].Значение) = Тип("ДокументСсылка.уатРеализацияУслуг") Тогда
			
			ПодразделениеОснований = ТаблицаТекущихОснований[0].Значение.Подразделение;
		КонецЕсли;
		
		ТаблицаИтоговПоОснованиям = ПолучитьТаблицуИтоговПоОснованиям(
			ТаблицаТекущихОснований, ЭтоСводнаяСправка, ЭтоКорректировочнаяСправка);
		
		Для Каждого СтрокаТаблицы Из ТаблицаТекущихОснований Цикл
			СтрокаДокументОснование = ДокументыОснования.Добавить();
			СтрокаДокументОснование.ДокументОснование = СтрокаТаблицы.Значение;
			СтрокаДокументОснование.Договор           = Параметры.Отбор.Договор;
			СтрокаДокументОснование.Валюта            = Параметры.Отбор.Валюта;
			СтрокаДокументОснование.Подразделение     = ПодразделениеОснований;
			
			Если (ЭтоСводнаяСправка ИЛИ ЭтоКорректировочнаяСправка)
				 И ЗначениеЗаполнено(ТаблицаИтоговПоОснованиям) Тогда
				
				НайденнаяСтрока = ТаблицаИтоговПоОснованиям.Найти(СтрокаДокументОснование.ДокументОснование, "ДокументОснование");
				
				Если ЗначениеЗаполнено(НайденнаяСтрока) Тогда
				
					ЗаполнитьЗначенияСвойств(СтрокаДокументОснование, НайденнаяСтрока,,"ДокументОснование");
					
				КонецЕсли;
			КонецЕсли;
			
			// Документ-основание в виде строки, значит это документ типовой конфигурации, и его нет в УАТ
			Если ТипЗнч(СтрокаТаблицы.Значение) = Тип("Строка") Тогда 
				ТолькоПросмотр = Истина;
				Элементы.ФормаЗаписатьИЗакрыть.Доступность = Ложь;
			КонецЕсли;
		КонецЦикла;
	
	КонецЕсли;
	
	Элементы.ДокументыОснованияСклад.Видимость          = ЭтоСводнаяСправка ИЛИ ЭтоКорректировочнаяСправка;
	Элементы.ДокументыОснованияСуммаДокумента.Видимость = ЭтоСводнаяСправка ИЛИ ЭтоКорректировочнаяСправка;
	Элементы.ФормаЗаполнить.Видимость                   = ЭтоСводнаяСправка ИЛИ ЭтоКорректировочнаяСправка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы
		И Модифицированность Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'; en = 'The data has been changed. Save changes?'");
		Оповещение = Новый ОписаниеОповещения("ВопросСохранитьИзмененияЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

// Функция выполняет запрос по получению суммы документа из документов оснований
// Параметры:
//			ТаблицаОснований - массив - список оснований
//			ЭтоСводнаяСправка - если счет-фактура это сводная справка
//			ЭтоКорректировочнаяСправка - если счет-фактура это корректировочная справка
//
// Возвращаемое значение:
// ТаблицаЗначений - 
//		ДокументОснование - документ основание
//		СуммаДокумента - Сумма по документу основания, * из документа ОтчетКомиссионераОПродажах собираются
//		только суммы без счетов-фактур, у остальных документов реквизит СуммаДокумента
//		Склад - из документов ОтчетОРозничныхПродажах, ВозвратТоваровОтПокупателя записывается склад, у остальных контрагент
//
&НаСервере
Функция ПолучитьТаблицуИтоговПоОснованиям(СписокОснований, ЭтоСводнаяСправка, ЭтоКорректировочнаяСправка)

	// Заглушка. В УАТ функционал сильно урезан по сравнению с БП
	Возврат Неопределено;
	
КонецФункции 

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ПеренестиДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	// Заглушка. В УАТ функционал сильно урезан по сравнению с БП
	Заглушка = Истина;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиРеквизитовФормы

&НаКлиенте
Процедура ДокументыОснованияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда
		Элементы.ДокументыОснования.ТекущиеДанные.ДокументОснование = ПредопределенноеЗначение("Документ.уатРеализацияУслуг.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПеренестиДанные(Отказ = Ложь)
	
	ОчиститьСообщения();
	
	СписокДокументовОснований = Новый СписокЗначений;
	ПерваяСтрока = Истина;
	
	РазныеДоговора 		= Ложь;
	РазныеВалюты 		= Ложь;
	РазныеПодразделения	= Ложь;
	
	Для Индекс = 0 По ДокументыОснования.Количество() - 1 Цикл
		
		СтрокаТаблицы = ДокументыОснования[Индекс];
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДокументОснование) Тогда
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В строке %1 не выбран документ.'; en = 'Document is not selected in line %1.'"),
				Индекс + 1);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				,
				"ДокументыОснования["+Индекс+"].ДокументОснование",
				,
				Отказ);
		КонецЕсли;
		
		Если Не ЭтоКорректировочный Тогда
			
			Если СписокДокументовОснований.НайтиПоЗначению(СтрокаТаблицы.ДокументОснование) <> Неопределено
			 И ЗначениеЗаполнено(СтрокаТаблицы.ДокументОснование) Тогда
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'В строке %1 повторно указан документ %2.'; en = 'Document %2 is specified once again in line %1. '"),
					Индекс + 1,
					СтрокаТаблицы.ДокументОснование);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					Текст,
					,
					"ДокументыОснования["+Индекс+"].ДокументОснование",
					,
					Отказ);
			КонецЕсли;
			
		КонецЕсли;
			
		Если ЗначениеЗаполнено(ДокументыОснования[Индекс].ДокументОснование) Тогда 
			Если ПерваяСтрока Тогда
				
				Договор 		= ДокументыОснования[Индекс].Договор;
				Валюта 			= ДокументыОснования[Индекс].Валюта;
				Подразделение 	= ДокументыОснования[Индекс].Подразделение;
				
				ПерваяСтрока = Ложь;
				
			ИначеЕсли НЕ ЭтоСводнаяСправка Тогда
				
				// Договор, валюту и подразделение имеет смысл сравнивать только для заполненных значений.
				
				Если ЗначениеЗаполнено(Договор)
					И ЗначениеЗаполнено(ДокументыОснования[Индекс].Договор) Тогда
					РазныеДоговора = РазныеДоговора ИЛИ Договор <> ДокументыОснования[Индекс].Договор;
				ИначеЕсли ЗначениеЗаполнено(ДокументыОснования[Индекс].Договор) Тогда 
					Договор = ДокументыОснования[Индекс].Договор;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Валюта)
					И ЗначениеЗаполнено(ДокументыОснования[Индекс].Валюта) Тогда 
					РазныеВалюты = РазныеВалюты ИЛИ Валюта <> ДокументыОснования[Индекс].Валюта;
				ИначеЕсли ЗначениеЗаполнено(ДокументыОснования[Индекс].Валюта) Тогда
					Валюта = ДокументыОснования[Индекс].Валюта;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Подразделение)
					И ЗначениеЗаполнено(ДокументыОснования[Индекс].Подразделение) Тогда
					РазныеПодразделения = РазныеПодразделения ИЛИ Подразделение <> ДокументыОснования[Индекс].Подразделение;
				ИначеЕсли ЗначениеЗаполнено(ДокументыОснования[Индекс].Подразделение) Тогда
					Подразделение = ДокументыОснования[Индекс].Подразделение;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
						
		СписокДокументовОснований.Добавить(СтрокаТаблицы.ДокументОснование);
		
	КонецЦикла;
	
	Если РазныеДоговора ИЛИ РазныеВалюты ИЛИ РазныеПодразделения Тогда
		
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'В список документов-оснований можно выбирать документы с одинаковым договором, валютой и подразделением'; en = 'In the list of supporting documents, you can select documents with the same contract, currency, and division'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ДокументыОснования"); 
		
	КонецЕсли;
				
	Если НЕ Отказ Тогда
		Модифицированность = Ложь;
		ОповеститьОВыборе(СписокДокументовОснований);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияДокументОснованиеПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ДокументыОснования.ТекущиеДанные;
	ДокументОснованиеРеквизиты = уатОбщегоНазначенияТиповые.ПолучитьЗначенияРеквизитов(ТекСтрока.ДокументОснование,
		"Подразделение, ДоговорКонтрагента, ВалютаДокумента");
	ТекСтрока.Подразделение = ДокументОснованиеРеквизиты.Подразделение;
	ТекСтрока.Договор       = ДокументОснованиеРеквизиты.ДоговорКонтрагента;
	ТекСтрока.Валюта        = ДокументОснованиеРеквизиты.ВалютаДокумента;
		
КонецПроцедуры

&НаКлиенте
Процедура ВопросСохранитьИзмененияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПеренестиДанные();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
